[
  {
    "file": "experiments/molnar_recreation_1.js",
    "name": "Structured chaos",
    "description": "During the class Molnar's art caught my attention. Decided to recriate it but tried to make it less crowded. Thought this would be a good beginning, being simple yet bold with the colors. The inspiration to decide to recriate this one, was the feeling of the chaos, but still with some structure. And for me, this is pretty much how life is."
  },

  {
    "file": "experiments/molnar_variation_1.js",
    "name": "Structured, animated chaos",
    "description": "For this variation I am using the noise for the colors instead of the random. Another aspect is that it is an animated version, to be more dynamic and fun"
  },
  {
    "file": "experiments/molnar_variation_2.js",
    "name": "Structured, animated, rainbow colors chaos",
    "description": "For this variation I am still using the noise for the colors instead of the random. It is animated and this time I am using HSB for colorMode to criate a rainbow style of colors on the stroke of the rectangles. Also adjusted the frameRate to get a better visualisation."
  },
  {
    "file": "experiments/tyler_recreation_1.js",
    "name": "Daisies",
    "description": "Inspired on tyler Hobbs, I decided to recreate this art that shows a grid with blue daisies, one different from another with different saturation as well. It's a minimalistic style that I also enjoy, giving the feeling of peace."
  },
  {
    "file": "experiments/tyler_variation_1.js",
    "name": "Spinning Daisies",
    "description": "The first variation chosen was to add movement to the daisies. In this first version the daisies spins randomnly using perlin noise, but they are with the same colors, and with a balanced movement and placement of the petals, keeping it balanced. "
  },
  {
    "file": "experiments/tyler_variation_2.js",
    "name": "Growing Daisies",
    "description": "The second variation I aimed for something more fun and colorful. Used perlin noise to make the colors of the daisies change and instead of the spinning movement this time the daisies are growing and shrinking giving it different sizes. The daisies shapes are more playful as well, giving to this version another feeling."
  },
  {
    "file": "experiments/flowfield_tyler_recreation.js",
    "name": "Flow field",
    "description": "Recreated Tyler Hobb's art, using flow field to generate this lines giving a structured, random pattern."
  },
  {
    "file": "experiments/flowfield_variation_1.js",
    "name": "Chaotic Flow field",
    "description": "In this variation I changed some numbers and the shape used in the recreation, in order to have a chaotic version."
  },
  {
    "file": "experiments/flowfield_variation_2.js",
    "name": "Magnetic Flow field",
    "description": "In this variation the mouse is interacting with the flow field creating an interesting feeling that the mouse is magnetic."
  },
  {
    "file": "experiments/game_of_life.js",
    "name": "Game of life",
    "description": "First trial for the game of life. Used Garrit's class and code and played with some values and shapes. Liked the result with the triangles."
  },
  {
    "file": "experiments/game_of_life_variation.js",
    "name": "Game of life variation",
    "description": "In this variation, we can click on the canvas to interact with the cells. The interaction happens within a radius giving it the possibility to interact with a certain area of the game."
  },
  {
    "file": "experiments/game_of_life_sound.js",
    "name": "Game of life with Sound",
    "description": "In this variation, I am incorporating the sound effects learned on the class using tone.js."
  },
  {
    "file": "experiments/flowfield_sound.js",
    "name": "Sound to the spinning daisies",
    "description": "In this variation, I am incorporating the sound effects learned on the class using tone.js."
  }
]
